app/controllers/posts_controller.rb

  def create
    # @post= Post.create(params[:post]) #we dont need instance since not passing forward data
    Post.create(title: params[:post][:title], description: params[:post][:description])
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My post title"], ["description", "My post description"], ["created_at", "2018-03-17 15:50:24.512413"], ["updated_at", "2018-03-17 15:50:24.512413"]]